
ex:     file format elf64-x86-64


Disassembly of section .init:

0000000000001000 <_init>:
    1000:	50                   	push   %rax
    1001:	58                   	pop    %rax
    1002:	c3                   	ret

Disassembly of section .plt:

0000000000001010 <putchar@plt-0x10>:
    1010:	ff 35 da 2f 00 00    	push   0x2fda(%rip)        # 3ff0 <_GLOBAL_OFFSET_TABLE_+0x8>
    1016:	ff 25 dc 2f 00 00    	jmp    *0x2fdc(%rip)        # 3ff8 <_GLOBAL_OFFSET_TABLE_+0x10>
    101c:	0f 1f 40 00          	nopl   0x0(%rax)

0000000000001020 <putchar@plt>:
    1020:	ff 25 da 2f 00 00    	jmp    *0x2fda(%rip)        # 4000 <putchar>
    1026:	68 00 00 00 00       	push   $0x0
    102b:	e9 e0 ff ff ff       	jmp    1010 <_init+0x10>

0000000000001030 <printf@plt>:
    1030:	ff 25 d2 2f 00 00    	jmp    *0x2fd2(%rip)        # 4008 <printf>
    1036:	68 01 00 00 00       	push   $0x1
    103b:	e9 d0 ff ff ff       	jmp    1010 <_init+0x10>

0000000000001040 <xcb_connect@plt>:
    1040:	ff 25 ca 2f 00 00    	jmp    *0x2fca(%rip)        # 4010 <xcb_connect>
    1046:	68 02 00 00 00       	push   $0x2
    104b:	e9 c0 ff ff ff       	jmp    1010 <_init+0x10>

0000000000001050 <__stack_chk_fail@plt>:
    1050:	ff 25 c2 2f 00 00    	jmp    *0x2fc2(%rip)        # 4018 <__stack_chk_fail>
    1056:	68 03 00 00 00       	push   $0x3
    105b:	e9 b0 ff ff ff       	jmp    1010 <_init+0x10>

0000000000001060 <xcb_setup_roots_iterator@plt>:

    <193>   DW_AT_comp_dir    : (indirect line string, offset: 0x29): /home/jaz/coding/Projects/Xorg
    <197>   DW_AT_low_pc      : 0x1215
    <19f>   DW_AT_high_pc     : 0x13e
    <1a7>   DW_AT_stmt_list   : 0xba
 <1><1ab>: Abbrev Number: 2 (DW_TAG_base_type)
    <1ac>   DW_AT_byte_size   : 8
    <1ad>   DW_AT_encoding    : 7	(unsigned)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x35c): long unsigned int
 <1><1b2>: Abbrev Number: 2 (DW_TAG_base_type)
    <1b3>   DW_AT_byte_size   : 8
    <1b4>   DW_AT_encoding    : 5	(signed)
    <1b5>   DW_AT_name        : (indirect string, offset: 0x152): long int
 <1><1b9>: Abbrev Number: 2 (DW_TAG_base_type)
    <1ba>   DW_AT_byte_size   : 4
    <1bb>   DW_AT_encoding    : 7	(unsigned)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x361): unsigned int
 <1><1c0>: Abbrev Number: 2 (DW_TAG_base_type)
    <1c1>   DW_AT_byte_size   : 1
    <1c2>   DW_AT_encoding    : 6	(signed char)
    <1c3>   DW_AT_name        : (indirect string, offset: 0x30f): char
 <1><1c7>: Abbrev Number: 6 (DW_TAG_const_type)
    <1c8>   DW_AT_type        : <0x1c0>
 <1><1cc>: Abbrev Number: 2 (DW_TAG_base_type)
    <1cd>   DW_AT_byte_size   : 8
    <1ce>   DW_AT_encoding    : 5	(signed)
    <1cf>   DW_AT_name        : (indirect string, offset: 0x14d): long long int
 <1><1d3>: Abbrev Number: 2 (DW_TAG_base_type)
    <1d4>   DW_AT_byte_size   : 8
    <1d5>   DW_AT_encoding    : 4	(float)
    <1d6>   DW_AT_name        : (indirect string, offset: 0xf): double
 <1><1da>: Abbrev Number: 2 (DW_TAG_base_type)
    <1db>   DW_AT_byte_size   : 1
    <1dc>   DW_AT_encoding    : 6	(signed char)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x308): signed char
 <1><1e1>: Abbrev Number: 2 (DW_TAG_base_type)
    <1e2>   DW_AT_byte_size   : 2
    <1e3>   DW_AT_encoding    : 5	(signed)
    <1e4>   DW_AT_name        : (indirect string, offset: 0x250): short int
 <1><1e8>: Abbrev Number: 12 (DW_TAG_base_type)
    <1e9>   DW_AT_byte_size   : 4
    <1ea>   DW_AT_encoding    : 5	(signed)
    <1eb>   DW_AT_name        : int
 <1><1ef>: Abbrev Number: 2 (DW_TAG_base_type)
    <1f0>   DW_AT_byte_size   : 1
    <1f1>   DW_AT_encoding    : 8	(unsigned char)
    <1f2>   DW_AT_name        : (indirect string, offset: 0x306): unsigned char
 <1><1f6>: Abbrev Number: 2 (DW_TAG_base_type)
    <1f7>   DW_AT_byte_size   : 2
    <1f8>   DW_AT_encoding    : 7	(unsigned)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x3f6): short unsigned int
 <1><1fd>: Abbrev Number: 2 (DW_TAG_base_type)
    <1fe>   DW_AT_byte_size   : 8
    <1ff>   DW_AT_encoding    : 7	(unsigned)
    <200>   DW_AT_name        : (indirect string, offset: 0x357): long long unsigned int
 <1><204>: Abbrev Number: 3 (DW_TAG_typedef)
    <205>   DW_AT_name        : (indirect string, offset: 0x39d): uint16_t
    <209>   DW_AT_decl_file   : 2
    <20a>   DW_AT_decl_line   : 126
    <20b>   DW_AT_decl_column : 25
    <20c>   DW_AT_type        : <0x1f6>
 <1><210>: Abbrev Number: 3 (DW_TAG_typedef)
    <211>   DW_AT_name        : (indirect string, offset: 0x298): uint32_t
    <215>   DW_AT_decl_file   : 2
    <216>   DW_AT_decl_line   : 131
    <217>   DW_AT_decl_column : 25
    <218>   DW_AT_type        : <0x1b9>
 <1><21c>: Abbrev Number: 3 (DW_TAG_typedef)
    <21d>   DW_AT_name        : (indirect string, offset: 0x283): uint8_t
    <221>   DW_AT_decl_file   : 2
    <222>   DW_AT_decl_line   : 121
    <223>   DW_AT_decl_column : 25
    <224>   DW_AT_type        : <0x1ef>
 <1><228>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <229>   DW_AT_byte_size   : 8
    <229>   DW_AT_type        : <0x1c7>
 <1><22d>: Abbrev Number: 3 (DW_TAG_typedef)
    <22e>   DW_AT_name        : (indirect string, offset: 0x4d7): xcb_connection_t
    <232>   DW_AT_decl_file   : 3
    <233>   DW_AT_decl_line   : 108
    <234>   DW_AT_decl_column : 33
    <235>   DW_AT_type        : <0x239>
 <1><239>: Abbrev Number: 13 (DW_TAG_structure_type)
    <23a>   DW_AT_name        : (indirect string, offset: 0x4d7): xcb_connection_t
    <23e>   DW_AT_declaration : 1
 <1><23e>: Abbrev Number: 3 (DW_TAG_typedef)
    <23f>   DW_AT_name        : (indirect string, offset: 0x3de): xcb_window_t
    <243>   DW_AT_decl_file   : 4
    <244>   DW_AT_decl_line   : 38
    <245>   DW_AT_decl_column : 18
    <246>   DW_AT_type        : <0x210>
 <1><24a>: Abbrev Number: 3 (DW_TAG_typedef)
    <24b>   DW_AT_name        : (indirect string, offset: 0x492): xcb_colormap_t
    <24f>   DW_AT_decl_file   : 4
    <250>   DW_AT_decl_line   : 93
    <251>   DW_AT_decl_column : 18
    <252>   DW_AT_type        : <0x210>
 <1><256>: Abbrev Number: 3 (DW_TAG_typedef)
    <257>   DW_AT_name        : (indirect string, offset: 0x197): xcb_visualid_t
    <25b>   DW_AT_decl_file   : 4
    <25c>   DW_AT_decl_line   : 148
    <25d>   DW_AT_decl_column : 18
    <25e>   DW_AT_type        : <0x210>
 <1><262>: Abbrev Number: 3 (DW_TAG_typedef)
    <263>   DW_AT_name        : (indirect string, offset: 0x275): xcb_keycode_t
    <267>   DW_AT_decl_file   : 4
    <268>   DW_AT_decl_line   : 181
    <269>   DW_AT_decl_column : 17
    <26a>   DW_AT_type        : <0x21c>
 <1><26e>: Abbrev Number: 14 (DW_TAG_array_type)
    <26f>   DW_AT_type        : <0x21c>
    <273>   DW_AT_sibling     : <0x27e>
 <2><277>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <278>   DW_AT_type        : <0x1ab>
    <27c>   DW_AT_upper_bound : 3
 <2><27d>: Abbrev Number: 0
 <1><27e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <27f>   DW_AT_name        : (indirect string, offset: 0x28b): xcb_screen_t
    <283>   DW_AT_byte_size   : 40
    <284>   DW_AT_decl_file   : 4
    <284>   DW_AT_decl_line   : 379
    <286>   DW_AT_decl_column : 16
    <286>   DW_AT_sibling     : <0x35b>
 <2><28a>: Abbrev Number: 1 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x52d): root
    <28f>   DW_AT_decl_file   : 4
    <28f>   DW_AT_decl_line   : 380
    <291>   DW_AT_decl_column : 20
    <292>   DW_AT_type        : <0x23e>
    <296>   DW_AT_data_member_location: 0
 <2><297>: Abbrev Number: 1 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0x442): default_colormap
    <29c>   DW_AT_decl_file   : 4
    <29c>   DW_AT_decl_line   : 381
    <29e>   DW_AT_decl_column : 20
    <29f>   DW_AT_type        : <0x24a>
    <2a3>   DW_AT_data_member_location: 4
 <2><2a4>: Abbrev Number: 1 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0x461): white_pixel
    <2a9>   DW_AT_decl_file   : 4
    <2a9>   DW_AT_decl_line   : 382
    <2ab>   DW_AT_decl_column : 20
    <2ac>   DW_AT_type        : <0x210>
    <2b0>   DW_AT_data_member_location: 8
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x2fa): black_pixel
    <2b6>   DW_AT_decl_file   : 4
    <2b6>   DW_AT_decl_line   : 383
    <2b8>   DW_AT_decl_column : 20
    <2b9>   DW_AT_type        : <0x210>
    <2bd>   DW_AT_data_member_location: 12
 <2><2be>: Abbrev Number: 1 (DW_TAG_member)
    <2bf>   DW_AT_name        : (indirect string, offset: 0x47e): current_input_masks
    <2c3>   DW_AT_decl_file   : 4
    <2c3>   DW_AT_decl_line   : 384
    <2c5>   DW_AT_decl_column : 20
    <2c6>   DW_AT_type        : <0x210>
    <2ca>   DW_AT_data_member_location: 16
 <2><2cb>: Abbrev Number: 1 (DW_TAG_member)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x51d): width_in_pixels
    <2d0>   DW_AT_decl_file   : 4
    <2d0>   DW_AT_decl_line   : 385
    <2d2>   DW_AT_decl_column : 20
    <2d3>   DW_AT_type        : <0x204>
    <2d7>   DW_AT_data_member_location: 20
 <2><2d8>: Abbrev Number: 1 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x2ba): height_in_pixels
    <2dd>   DW_AT_decl_file   : 4
    <2dd>   DW_AT_decl_line   : 386
    <2df>   DW_AT_decl_column : 20
    <2e0>   DW_AT_type        : <0x204>
    <2e4>   DW_AT_data_member_location: 22
 <2><2e5>: Abbrev Number: 1 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x314): width_in_millimeters
    <2ea>   DW_AT_decl_file   : 4
    <2ea>   DW_AT_decl_line   : 387
    <2ec>   DW_AT_decl_column : 20
    <2ed>   DW_AT_type        : <0x204>
    <2f1>   DW_AT_data_member_location: 24
 <2><2f2>: Abbrev Number: 1 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x21d): height_in_millimeters
    <2f7>   DW_AT_decl_file   : 4
    <2f7>   DW_AT_decl_line   : 388
    <2f9>   DW_AT_decl_column : 20
    <2fa>   DW_AT_type        : <0x204>
    <2fe>   DW_AT_data_member_location: 26
 <2><2ff>: Abbrev Number: 1 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0x20a): min_installed_maps
    <304>   DW_AT_decl_file   : 4
    <304>   DW_AT_decl_line   : 389
    <306>   DW_AT_decl_column : 20
    <307>   DW_AT_type        : <0x204>
    <30b>   DW_AT_data_member_location: 28
 <2><30c>: Abbrev Number: 1 (DW_TAG_member)
    <30d>   DW_AT_name        : (indirect string, offset: 0x23d): max_installed_maps
    <311>   DW_AT_decl_file   : 4
    <311>   DW_AT_decl_line   : 390
    <313>   DW_AT_decl_column : 20
    <314>   DW_AT_type        : <0x204>
    <318>   DW_AT_data_member_location: 30
 <2><319>: Abbrev Number: 1 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x269): root_visual
    <31e>   DW_AT_decl_file   : 4
    <31e>   DW_AT_decl_line   : 391
    <320>   DW_AT_decl_column : 20
    <321>   DW_AT_type        : <0x256>
    <325>   DW_AT_data_member_location: 32
 <2><326>: Abbrev Number: 1 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0x25a): backing_stores
    <32b>   DW_AT_decl_file   : 4
    <32b>   DW_AT_decl_line   : 392
    <32d>   DW_AT_decl_column : 20
    <32e>   DW_AT_type        : <0x21c>
    <332>   DW_AT_data_member_location: 36
 <2><333>: Abbrev Number: 1 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x4ed): save_unders
    <338>   DW_AT_decl_file   : 4
    <338>   DW_AT_decl_line   : 393
    <33a>   DW_AT_decl_column : 20
    <33b>   DW_AT_type        : <0x21c>
    <33f>   DW_AT_data_member_location: 37
 <2><340>: Abbrev Number: 1 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0x3eb): root_depth
    <345>   DW_AT_decl_file   : 4
    <345>   DW_AT_decl_line   : 394
    <347>   DW_AT_decl_column : 20
    <348>   DW_AT_type        : <0x21c>
    <34c>   DW_AT_data_member_location: 38
 <2><34d>: Abbrev Number: 1 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x50a): allowed_depths_len
    <352>   DW_AT_decl_file   : 4
    <352>   DW_AT_decl_line   : 395
    <354>   DW_AT_decl_column : 20
    <355>   DW_AT_type        : <0x21c>
    <359>   DW_AT_data_member_location: 39
 <2><35a>: Abbrev Number: 0
 <1><35b>: Abbrev Number: 8 (DW_TAG_typedef)
    <35c>   DW_AT_name        : (indirect string, offset: 0x28b): xcb_screen_t
    <360>   DW_AT_decl_file   : 4
    <360>   DW_AT_decl_line   : 396
    <362>   DW_AT_decl_column : 3
    <362>   DW_AT_type        : <0x27e>
 <1><366>: Abbrev Number: 7 (DW_TAG_structure_type)
    <367>   DW_AT_name        : (indirect string, offset: 0x4b2): xcb_screen_iterator_t
    <36b>   DW_AT_byte_size   : 16
    <36c>   DW_AT_decl_file   : 4
    <36c>   DW_AT_decl_line   : 401
    <36e>   DW_AT_decl_column : 16
    <36e>   DW_AT_sibling     : <0x39b>
 <2><372>: Abbrev Number: 1 (DW_TAG_member)
    <373>   DW_AT_name        : (indirect string, offset: 0x46d): data
    <377>   DW_AT_decl_file   : 4
    <377>   DW_AT_decl_line   : 402
    <379>   DW_AT_decl_column : 19
    <37a>   DW_AT_type        : <0x39b>
    <37e>   DW_AT_data_member_location: 0
 <2><37f>: Abbrev Number: 16 (DW_TAG_member)
    <380>   DW_AT_name        : rem
    <384>   DW_AT_decl_file   : 4
    <385>   DW_AT_decl_line   : 403
    <387>   DW_AT_decl_column : 19
    <388>   DW_AT_type        : <0x1e8>
    <38c>   DW_AT_data_member_location: 8
 <2><38d>: Abbrev Number: 1 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x1ec): index
    <392>   DW_AT_decl_file   : 4
    <392>   DW_AT_decl_line   : 404
    <394>   DW_AT_decl_column : 19
    <395>   DW_AT_type        : <0x1e8>
    <399>   DW_AT_data_member_location: 12
 <2><39a>: Abbrev Number: 0
 <1><39b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <39c>   DW_AT_byte_size   : 8
    <39c>   DW_AT_type        : <0x35b>
 <1><3a0>: Abbrev Number: 8 (DW_TAG_typedef)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x4b2): xcb_screen_iterator_t
    <3a5>   DW_AT_decl_file   : 4
    <3a5>   DW_AT_decl_line   : 405
    <3a7>   DW_AT_decl_column : 3
    <3a7>   DW_AT_type        : <0x366>
 <1><3ab>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3ac>   DW_AT_name        : (indirect string, offset: 0x1a6): xcb_setup_t
    <3b0>   DW_AT_byte_size   : 40
    <3b1>   DW_AT_decl_file   : 4
    <3b1>   DW_AT_decl_line   : 475
    <3b3>   DW_AT_decl_column : 16
    <3b3>   DW_AT_sibling     : <0x4bc>
 <2><3b7>: Abbrev Number: 1 (DW_TAG_member)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x409): status
    <3bc>   DW_AT_decl_file   : 4
    <3bc>   DW_AT_decl_line   : 476
    <3be>   DW_AT_decl_column : 19
    <3bf>   DW_AT_type        : <0x21c>
    <3c3>   DW_AT_data_member_location: 0
 <2><3c4>: Abbrev Number: 1 (DW_TAG_member)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x2d6): pad0
    <3c9>   DW_AT_decl_file   : 4
    <3c9>   DW_AT_decl_line   : 477
    <3cb>   DW_AT_decl_column : 19
    <3cc>   DW_AT_type        : <0x21c>
    <3d0>   DW_AT_data_member_location: 1
 <2><3d1>: Abbrev Number: 1 (DW_TAG_member)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x42b): protocol_major_version
    <3d6>   DW_AT_decl_file   : 4
    <3d6>   DW_AT_decl_line   : 478
    <3d8>   DW_AT_decl_column : 19
    <3d9>   DW_AT_type        : <0x204>
    <3dd>   DW_AT_data_member_location: 2
 <2><3de>: Abbrev Number: 1 (DW_TAG_member)
    <3df>   DW_AT_name        : (indirect string, offset: 0x340): protocol_minor_version
    <3e3>   DW_AT_decl_file   : 4
    <3e3>   DW_AT_decl_line   : 479
    <3e5>   DW_AT_decl_column : 19
    <3e6>   DW_AT_type        : <0x204>
    <3ea>   DW_AT_data_member_location: 4
 <2><3eb>: Abbrev Number: 1 (DW_TAG_member)
    <3ec>   DW_AT_name        : (indirect string, offset: 0x37e): length
    <3f0>   DW_AT_decl_file   : 4
    <3f0>   DW_AT_decl_line   : 480
    <3f2>   DW_AT_decl_column : 19
    <3f3>   DW_AT_type        : <0x204>
    <3f7>   DW_AT_data_member_location: 6
 <2><3f8>: Abbrev Number: 1 (DW_TAG_member)
    <3f9>   DW_AT_name        : (indirect string, offset: 0x4c8): release_number
    <3fd>   DW_AT_decl_file   : 4
    <3fd>   DW_AT_decl_line   : 481
    <3ff>   DW_AT_decl_column : 19
    <400>   DW_AT_type        : <0x210>
    <404>   DW_AT_data_member_location: 8
 <2><405>: Abbrev Number: 1 (DW_TAG_member)
    <406>   DW_AT_name        : (indirect string, offset: 0x4f9): resource_id_base
    <40a>   DW_AT_decl_file   : 4
    <40a>   DW_AT_decl_line   : 482
    <40c>   DW_AT_decl_column : 19
    <40d>   DW_AT_type        : <0x210>
    <411>   DW_AT_data_member_location: 12
 <2><412>: Abbrev Number: 1 (DW_TAG_member)
    <413>   DW_AT_name        : (indirect string, offset: 0x4a1): resource_id_mask
    <417>   DW_AT_decl_file   : 4
    <417>   DW_AT_decl_line   : 483
    <419>   DW_AT_decl_column : 19
    <41a>   DW_AT_type        : <0x210>
    <41e>   DW_AT_data_member_location: 16
 <2><41f>: Abbrev Number: 1 (DW_TAG_member)
    <420>   DW_AT_name        : (indirect string, offset: 0x1bd): motion_buffer_size
    <424>   DW_AT_decl_file   : 4
    <424>   DW_AT_decl_line   : 484
    <426>   DW_AT_decl_column : 19
    <427>   DW_AT_type        : <0x210>
    <42b>   DW_AT_data_member_location: 20
 <2><42c>: Abbrev Number: 1 (DW_TAG_member)
    <42d>   DW_AT_name        : (indirect string, offset: 0x1b2): vendor_len
    <431>   DW_AT_decl_file   : 4
    <431>   DW_AT_decl_line   : 485
    <433>   DW_AT_decl_column : 19
    <434>   DW_AT_type        : <0x204>
    <438>   DW_AT_data_member_location: 24
 <2><439>: Abbrev Number: 1 (DW_TAG_member)
    <43a>   DW_AT_name        : (indirect string, offset: 0x36e): maximum_request_length
    <43e>   DW_AT_decl_file   : 4
    <43e>   DW_AT_decl_line   : 486
    <440>   DW_AT_decl_column : 19
    <441>   DW_AT_type        : <0x204>
    <445>   DW_AT_data_member_location: 26
 <2><446>: Abbrev Number: 1 (DW_TAG_member)
    <447>   DW_AT_name        : (indirect string, offset: 0x233): roots_len
    <44b>   DW_AT_decl_file   : 4
    <44b>   DW_AT_decl_line   : 487
    <44d>   DW_AT_decl_column : 19
    <44e>   DW_AT_type        : <0x21c>
    <452>   DW_AT_data_member_location: 28
 <2><453>: Abbrev Number: 1 (DW_TAG_member)
    <454>   DW_AT_name        : (indirect string, offset: 0x2e0): pixmap_formats_len
    <458>   DW_AT_decl_file   : 4
    <458>   DW_AT_decl_line   : 488
    <45a>   DW_AT_decl_column : 19
    <45b>   DW_AT_type        : <0x21c>
    <45f>   DW_AT_data_member_location: 29
 <2><460>: Abbrev Number: 1 (DW_TAG_member)
    <461>   DW_AT_name        : (indirect string, offset: 0x186): image_byte_order
    <465>   DW_AT_decl_file   : 4
    <465>   DW_AT_decl_line   : 489
    <467>   DW_AT_decl_column : 19
    <468>   DW_AT_type        : <0x21c>
    <46c>   DW_AT_data_member_location: 30
 <2><46d>: Abbrev Number: 1 (DW_TAG_member)
    <46e>   DW_AT_name        : (indirect string, offset: 0x385): bitmap_format_bit_order
    <472>   DW_AT_decl_file   : 4
    <472>   DW_AT_decl_line   : 490
    <474>   DW_AT_decl_column : 19
    <475>   DW_AT_type        : <0x21c>
    <479>   DW_AT_data_member_location: 31
 <2><47a>: Abbrev Number: 1 (DW_TAG_member)
    <47b>   DW_AT_name        : (indirect string, offset: 0x1d0): bitmap_format_scanline_unit
    <47f>   DW_AT_decl_file   : 4
    <47f>   DW_AT_decl_line   : 491
    <481>   DW_AT_decl_column : 19
    <482>   DW_AT_type        : <0x21c>
    <486>   DW_AT_data_member_location: 32
 <2><487>: Abbrev Number: 1 (DW_TAG_member)
    <488>   DW_AT_name        : (indirect string, offset: 0x410): bitmap_format_scanline_pad
    <48c>   DW_AT_decl_file   : 4
    <48c>   DW_AT_decl_line   : 492
    <48e>   DW_AT_decl_column : 19
    <48f>   DW_AT_type        : <0x21c>
    <493>   DW_AT_data_member_location: 33
 <2><494>: Abbrev Number: 1 (DW_TAG_member)
    <495>   DW_AT_name        : (indirect string, offset: 0x1fe): min_keycode
    <499>   DW_AT_decl_file   : 4
    <499>   DW_AT_decl_line   : 493
    <49b>   DW_AT_decl_column : 19
    <49c>   DW_AT_type        : <0x262>
    <4a0>   DW_AT_data_member_location: 34
 <2><4a1>: Abbrev Number: 1 (DW_TAG_member)
    <4a2>   DW_AT_name        : (indirect string, offset: 0x1f2): max_keycode
    <4a6>   DW_AT_decl_file   : 4
    <4a6>   DW_AT_decl_line   : 494
    <4a8>   DW_AT_decl_column : 19
    <4a9>   DW_AT_type        : <0x262>
    <4ad>   DW_AT_data_member_location: 35
 <2><4ae>: Abbrev Number: 1 (DW_TAG_member)
    <4af>   DW_AT_name        : (indirect string, offset: 0x2db): pad1
    <4b3>   DW_AT_decl_file   : 4
    <4b3>   DW_AT_decl_line   : 495
    <4b5>   DW_AT_decl_column : 19
    <4b6>   DW_AT_type        : <0x26e>
    <4ba>   DW_AT_data_member_location: 36
 <2><4bb>: Abbrev Number: 0
 <1><4bc>: Abbrev Number: 6 (DW_TAG_const_type)
    <4bd>   DW_AT_type        : <0x3ab>
 <1><4c1>: Abbrev Number: 8 (DW_TAG_typedef)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x1a6): xcb_setup_t
    <4c6>   DW_AT_decl_file   : 4
    <4c6>   DW_AT_decl_line   : 496
    <4c8>   DW_AT_decl_column : 3
    <4c8>   DW_AT_type        : <0x3ab>
 <1><4cc>: Abbrev Number: 6 (DW_TAG_const_type)
    <4cd>   DW_AT_type        : <0x4c1>
 <1><4d1>: Abbrev Number: 17 (DW_TAG_subprogram)
    <4d2>   DW_AT_external    : 1
    <4d2>   DW_AT_name        : (indirect string, offset: 0x2f3): printf
    <4d6>   DW_AT_decl_file   : 5
    <4d7>   DW_AT_decl_line   : 109
    <4d8>   DW_AT_decl_column : 5
    <4d9>   DW_AT_prototyped  : 1
    <4d9>   DW_AT_type        : <0x1e8>
    <4dd>   DW_AT_declaration : 1
    <4dd>   DW_AT_sibling     : <0x4e8>
 <2><4e1>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <4e2>   DW_AT_type        : <0x228>
 <2><4e6>: Abbrev Number: 18 (DW_TAG_unspecified_parameters)
 <2><4e7>: Abbrev Number: 0
 <1><4e8>: Abbrev Number: 19 (DW_TAG_subprogram)
    <4e9>   DW_AT_external    : 1
    <4e9>   DW_AT_name        : (indirect string, offset: 0x329): xcb_screen_next
    <4ed>   DW_AT_decl_file   : 4
    <4ee>   DW_AT_decl_line   : 5451
    <4f0>   DW_AT_decl_column : 1
    <4f1>   DW_AT_prototyped  : 1
    <4f1>   DW_AT_declaration : 1
    <4f1>   DW_AT_sibling     : <0x4fb>
 <2><4f5>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <4f6>   DW_AT_type        : <0x4fb>
 <2><4fa>: Abbrev Number: 0
 <1><4fb>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <4fc>   DW_AT_byte_size   : 8
    <4fc>   DW_AT_type        : <0x3a0>
 <1><500>: Abbrev Number: 9 (DW_TAG_subprogram)
    <501>   DW_AT_external    : 1
    <501>   DW_AT_name        : (indirect string, offset: 0x2a1): xcb_setup_roots_iterator
    <505>   DW_AT_decl_file   : 4
    <506>   DW_AT_decl_line   : 5604
    <508>   DW_AT_decl_column : 1
    <509>   DW_AT_prototyped  : 1
    <509>   DW_AT_type        : <0x3a0>
    <50d>   DW_AT_declaration : 1
    <50d>   DW_AT_sibling     : <0x517>
 <2><511>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <512>   DW_AT_type        : <0x517>
 <2><516>: Abbrev Number: 0
 <1><517>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <518>   DW_AT_byte_size   : 8
    <518>   DW_AT_type        : <0x4cc>
 <1><51c>: Abbrev Number: 9 (DW_TAG_subprogram)
    <51d>   DW_AT_external    : 1
    <51d>   DW_AT_name        : (indirect string, offset: 0x453): xcb_get_setup
    <521>   DW_AT_decl_file   : 3
    <522>   DW_AT_decl_line   : 472
    <524>   DW_AT_decl_column : 27
    <525>   DW_AT_prototyped  : 1
    <525>   DW_AT_type        : <0x533>
    <529>   DW_AT_declaration : 1
    <529>   DW_AT_sibling     : <0x533>
 <2><52d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <52e>   DW_AT_type        : <0x538>
 <2><532>: Abbrev Number: 0
 <1><533>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <534>   DW_AT_byte_size   : 8
    <534>   DW_AT_type        : <0x4bc>
 <1><538>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <539>   DW_AT_byte_size   : 8
    <539>   DW_AT_type        : <0x22d>
 <1><53d>: Abbrev Number: 9 (DW_TAG_subprogram)
    <53e>   DW_AT_external    : 1
    <53e>   DW_AT_name        : (indirect string, offset: 0x472): xcb_connect
    <542>   DW_AT_decl_file   : 3
    <543>   DW_AT_decl_line   : 571
    <545>   DW_AT_decl_column : 19
    <546>   DW_AT_prototyped  : 1
    <546>   DW_AT_type        : <0x538>
    <54a>   DW_AT_declaration : 1
    <54a>   DW_AT_sibling     : <0x559>
 <2><54e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <54f>   DW_AT_type        : <0x228>
 <2><553>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <554>   DW_AT_type        : <0x559>
 <2><558>: Abbrev Number: 0
 <1><559>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <55a>   DW_AT_byte_size   : 8
    <55a>   DW_AT_type        : <0x1e8>
 <1><55e>: Abbrev Number: 20 (DW_TAG_subprogram)
